results/cpu-vs-latency5/memcached/9-2/nsl202.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2415754 ops,   85363 (avg:   80523) ops/sec, 3.22MB/sec (avg: 3.04MB/sec),  1.68 (avg:  1.79) msec latency

9         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        7575.11          ---          ---      1.78900       561.50
Gets       75725.67      8642.16     67083.50      1.78400      2655.37
Totals     83300.77      8642.16     67083.50      1.78500      3216.87


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     80.34377
SET       2.000     90.60365
SET       3.000     97.66434
SET       4.000     97.75811
SET       5.000     97.83823
SET       6.000     99.47378
SET       7.000     99.54662
SET       8.000     99.98361
SET       9.000     99.99317
SET      11.000     99.99363
SET      13.000     99.99408
SET      14.000     99.99454
SET      15.000     99.99499
SET      16.000     99.99545
SET      17.000     99.99636
SET      19.000     99.99681
SET      23.000     99.99727
SET      26.000     99.99772
SET      28.000     99.99818
SET      76.000     99.99863
SET      78.000     99.99909
SET      84.000     99.99954
SET      87.000    100.00000
---
GET       0.160      0.00005
GET       0.200      0.00018
GET       0.210      0.00036
GET       0.220      0.00041
GET       0.230      0.00055
GET       0.240      0.00077
GET       0.250      0.00096
GET       0.260      0.00118
GET       0.270      0.00150
GET       0.280      0.00209
GET       0.290      0.00287
GET       0.300      0.00373
GET       0.310      0.00505
GET       0.320      0.00592
GET       0.330      0.00756
GET       0.340      0.00956
GET       0.350      0.01125
GET       0.360      0.01334
GET       0.370      0.01617
GET       0.380      0.01981
GET       0.390      0.02514
GET       0.400      0.03069
GET       0.410      0.03479
GET       0.420      0.03843
GET       0.430      0.04180
GET       0.440      0.04595
GET       0.450      0.04895
GET       0.460      0.05109
GET       0.470      0.05323
GET       0.480      0.05533
GET       0.490      0.05719
GET       0.500      0.05888
GET       0.510      0.06024
GET       0.520      0.06229
GET       0.530      0.06430
GET       0.540      0.06653
GET       0.550      0.06853
GET       0.560      0.07031
GET       0.570      0.07345
GET       0.580      0.07668
GET       0.590      0.07982
GET       0.600      0.08301
GET       0.610      0.08574
GET       0.620      0.08829
GET       0.630      0.09257
GET       0.640      0.09594
GET       0.650      0.09972
GET       0.660      0.10364
GET       0.670      0.10651
GET       0.680      0.10992
GET       0.690      0.11407
GET       0.700      0.11817
GET       0.710      0.12240
GET       0.720      0.12718
GET       0.730      0.13269
GET       0.740      0.13879
GET       0.750      0.14663
GET       0.760      0.15346
GET       0.770      0.16215
GET       0.780      0.17217
GET       0.790      0.18278
GET       0.800      0.19325
GET       0.810      0.20268
GET       0.820      0.21238
GET       0.830      0.22144
GET       0.840      0.23141
GET       0.850      0.24029
GET       0.860      0.24967
GET       0.870      0.26006
GET       0.880      0.26975
GET       0.890      0.28114
GET       0.900      0.29421
GET       0.910      0.30841
GET       0.920      0.32239
GET       0.930      0.33911
GET       0.940      0.35741
GET       0.950      0.37831
GET       0.960      0.40158
GET       0.970      0.42995
GET       0.980      0.45941
GET       0.990      0.49607
GET       1.000      0.90502
GET       1.100     19.32805
GET       1.200     56.71815
GET       1.300     59.34862
GET       1.400     59.84277
GET       1.500     60.74885
GET       1.600     65.26076
GET       1.700     67.24157
GET       1.800     73.02030
GET       1.900     79.03139
GET       2.000     79.73087
GET       2.100     79.85800
GET       2.200     79.96815
GET       2.300     81.38281
GET       2.400     82.55768
GET       2.500     82.96473
GET       2.600     84.84053
GET       2.700     87.05357
GET       2.800     88.53554
GET       2.900     89.70708
GET       3.000     90.22933
GET       3.100     90.32532
GET       3.200     90.36034
GET       3.300     90.37965
GET       3.400     90.41189
GET       3.500     90.61548
GET       3.600     92.07449
GET       3.700     94.94388
GET       3.800     96.61063
GET       3.900     97.06508
GET       4.000     97.14427
GET       4.100     97.16189
GET       4.200     97.16999
GET       4.300     97.17655
GET       4.400     97.18288
GET       4.500     97.19026
GET       4.600     97.19782
GET       4.700     97.20469
GET       4.800     97.21025
GET       4.900     97.21457
GET       5.000     97.21717
GET       5.100     97.22172
GET       5.200     97.22541
GET       5.300     97.23019
GET       5.400     97.23497
GET       5.500     97.24053
GET       5.600     97.24763
GET       5.700     97.25387
GET       5.800     97.26298
GET       5.900     97.27500
GET       6.000     97.30246
GET       6.100     97.37395
GET       6.200     97.51379
GET       6.300     97.72676
GET       6.400     98.00576
GET       6.500     98.28986
GET       6.600     98.54463
GET       6.700     98.73410
GET       6.800     98.84844
GET       6.900     98.89589
GET       7.000     98.91174
GET       7.100     98.91597
GET       7.200     98.91734
GET       7.300     98.91807
GET       7.400     98.92076
GET       7.500     98.92681
GET       7.600     98.93952
GET       7.700     98.95805
GET       7.800     98.98897
GET       7.900     99.04124
GET       8.000     99.11428
GET       8.100     99.22840
GET       8.200     99.37844
GET       8.300     99.55776
GET       8.400     99.71367
GET       8.500     99.82678
GET       8.600     99.90087
GET       8.700     99.94053
GET       8.800     99.96580
GET       8.900     99.98138
GET       9.000     99.98962
GET       9.100     99.99312
GET       9.200     99.99417
GET       9.300     99.99422
GET       9.400     99.99467
GET       9.500     99.99567
GET       9.600     99.99681
GET       9.700     99.99791
GET       9.800     99.99854
GET       9.900     99.99950
GET      10.000    100.00000