results/cpu-vs-latency5/memcached/9-2/nsl203.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2514827 ops,   82827 (avg:   83825) ops/sec, 3.12MB/sec (avg: 3.16MB/sec),  1.74 (avg:  1.71) msec latency

9         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        7885.23          ---          ---      1.76600       584.49
Gets       78829.80      8823.03     70006.78      1.70900      2764.22
Totals     86715.03      8823.03     70006.78      1.71400      3348.71


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     92.67667
SET       2.000     94.69958
SET       3.000     96.05475
SET       4.000     96.05956
SET       5.000     96.07005
SET       6.000     96.08842
SET       7.000     96.10329
SET       8.000     96.15227
SET       9.000     97.15017
SET      10.000     99.53909
SET      11.000     99.94534
SET      12.000     99.96064
SET      13.000     99.96239
SET      14.000     99.96327
SET      15.000     99.96677
SET      16.000     99.96851
SET      17.000     99.97114
SET      22.000     99.97158
SET      24.000     99.97201
SET      25.000     99.97245
SET      27.000     99.97289
SET      28.000     99.97464
SET      29.000     99.97595
SET      31.000     99.97770
SET      32.000     99.97857
SET      34.000     99.97901
SET      35.000     99.97945
SET      36.000     99.97988
SET      37.000     99.98032
SET      38.000     99.98076
SET      46.000     99.98120
SET      47.000     99.98163
SET      48.000     99.98251
SET      49.000     99.98295
SET      58.000     99.98382
SET      59.000     99.98426
SET      60.000     99.98513
SET      61.000     99.98557
SET      64.000     99.98644
SET      65.000     99.98688
SET      66.000     99.98732
SET      82.000     99.98776
SET      84.000     99.98819
SET      87.000     99.98863
SET      90.000     99.98907
SET      93.000     99.98950
SET     110.000     99.98994
SET     160.000     99.99038
SET     170.000     99.99125
SET     180.000     99.99169
SET     240.000     99.99257
SET     250.000     99.99300
SET     260.000     99.99344
SET     350.000     99.99388
SET     360.000     99.99475
SET     380.000     99.99519
SET     480.000     99.99606
SET     490.000     99.99650
SET     510.000     99.99694
SET     620.000     99.99738
SET     630.000     99.99781
SET     640.000     99.99825
SET     760.000     99.99869
SET     770.000     99.99913
SET     780.000     99.99956
SET     830.000    100.00000
---
GET       0.310      0.00004
GET       0.320      0.00026
GET       0.330      0.00031
GET       0.350      0.00035
GET       0.360      0.00044
GET       0.380      0.00057
GET       0.400      0.00061
GET       0.410      0.00092
GET       0.420      0.00114
GET       0.430      0.00171
GET       0.440      0.00206
GET       0.450      0.00254
GET       0.460      0.00346
GET       0.470      0.00433
GET       0.480      0.00569
GET       0.490      0.00735
GET       0.500      0.00945
GET       0.510      0.01190
GET       0.520      0.01417
GET       0.530      0.01780
GET       0.540      0.02148
GET       0.550      0.02708
GET       0.560      0.03316
GET       0.570      0.03867
GET       0.580      0.04584
GET       0.590      0.05336
GET       0.600      0.06023
GET       0.610      0.06653
GET       0.620      0.07248
GET       0.630      0.07755
GET       0.640      0.08206
GET       0.650      0.08626
GET       0.660      0.08980
GET       0.670      0.09256
GET       0.680      0.09606
GET       0.690      0.09916
GET       0.700      0.10327
GET       0.710      0.10782
GET       0.720      0.11198
GET       0.730      0.11539
GET       0.740      0.11876
GET       0.750      0.12256
GET       0.760      0.12598
GET       0.770      0.12943
GET       0.780      0.13258
GET       0.790      0.13687
GET       0.800      0.14032
GET       0.810      0.14413
GET       0.820      0.14920
GET       0.830      0.15515
GET       0.840      0.16219
GET       0.850      0.16871
GET       0.860      0.17676
GET       0.870      0.18420
GET       0.880      0.19391
GET       0.890      0.20410
GET       0.900      0.21385
GET       0.910      0.22461
GET       0.920      0.23695
GET       0.930      0.25217
GET       0.940      0.26897
GET       0.950      0.28887
GET       0.960      0.31258
GET       0.970      0.33804
GET       0.980      0.36607
GET       0.990      0.39617
GET       1.000      0.73819
GET       1.100     16.00160
GET       1.200     67.47020
GET       1.300     71.99904
GET       1.400     72.88271
GET       1.500     73.00585
GET       1.600     73.24678
GET       1.700     79.15790
GET       1.800     90.69006
GET       1.900     92.63066
GET       2.000     92.92351
GET       2.100     92.96353
GET       2.200     92.98081
GET       2.300     93.54363
GET       2.400     94.54125
GET       2.500     94.70607
GET       2.600     94.74216
GET       2.700     94.74710
GET       2.800     94.74881
GET       2.900     94.74994
GET       3.000     94.75112
GET       3.100     94.75217
GET       3.200     94.75349
GET       3.300     94.76215
GET       3.400     94.87255
GET       3.500     95.45572
GET       3.600     95.95083
GET       3.700     96.06810
GET       3.800     96.09264
GET       3.900     96.09771
GET       4.000     96.09968
GET       4.100     96.10003
GET       4.200     96.10016
GET       4.300     96.10021
GET       4.400     96.10034
GET       4.500     96.10043
GET       4.600     96.10056
GET       4.700     96.10095
GET       4.800     96.10148
GET       4.900     96.10204
GET       5.000     96.10253
GET       5.100     96.10318
GET       5.200     96.10362
GET       5.300     96.10428
GET       5.400     96.10493
GET       5.500     96.10554
GET       5.600     96.10738
GET       5.700     96.10874
GET       5.800     96.11049
GET       5.900     96.11184
GET       6.000     96.11346
GET       6.100     96.11521
GET       6.200     96.11714
GET       6.300     96.11906
GET       6.400     96.12024
GET       6.500     96.12138
GET       6.600     96.12203
GET       6.700     96.12300
GET       6.800     96.12392
GET       6.900     96.12593
GET       7.000     96.12776
GET       7.100     96.12934
GET       7.200     96.13096
GET       7.300     96.13236
GET       7.400     96.13349
GET       7.500     96.13481
GET       7.600     96.13616
GET       7.700     96.13804
GET       7.800     96.13997
GET       7.900     96.14277
GET       8.000     96.14504
GET       8.100     96.14837
GET       8.200     96.15257
GET       8.300     96.15598
GET       8.400     96.16022
GET       8.500     96.16451
GET       8.600     96.16971
GET       8.700     96.17479
GET       8.800     96.18004
GET       8.900     96.18752
GET       9.000     96.19889
GET       9.100     96.21678
GET       9.200     96.24071
GET       9.300     96.27080
GET       9.400     96.33335
GET       9.500     96.44909
GET       9.600     96.60214
GET       9.700     96.76281
GET       9.800     96.93064
GET       9.900     97.11851
GET      10.000     98.47175
GET      11.000     99.89515
GET      12.000     99.99615
GET      13.000     99.99952
GET      14.000     99.99956
GET      15.000     99.99965
GET      17.000     99.99983
GET      18.000     99.99987
GET      19.000     99.99991
GET      20.000    100.00000